driver-tests/bpelse/samples/samplesJBI/test/echo_echo1/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:FooBar">
  <soapenv:Body>
    <urn:helloObj>
<urn:string>TestString</urn:string>
          <urn:nonNegativeInteger>200</urn:nonNegativeInteger>
          <urn:byte>2</urn:byte>
          <urn:short>1</urn:short>
          <urn:int>3</urn:int>
          <urn:long>10</urn:long>
          <urn:negativeInteger>-201</urn:negativeInteger>
          <urn:dateTime>2008-09-28T18:49:45</urn:dateTime>
          <urn:nonPositiveInteger>-200</urn:nonPositiveInteger>
          <urn:duration>P1Y2M6DT14H25M13S</urn:duration>
          <urn:ENTITIES>string</urn:ENTITIES>
          <urn:double>1.051732E7</urn:double>
          <urn:ENTITY>string</urn:ENTITY>
          <urn:float>1.5E2</urn:float>
    </urn:helloObj>
  </soapenv:Body>
</soapenv:Envelope>